CLASS_3_GROUPS_SELECTOR = [
    "The Light Land",
    "CEO",
    "Yao Jie",
    "Under One",
    "Phoenix Chck",
    "Blow",
    "Mintyouth",
    "Dawn"
]

CLASS_3_STUDENTS = ['郑茹', '王悦', '司灝', '纪云鹏', '丁杨', '陈俊如', '张洪宁', '刘晋言', '高远', '宁静', '林美君', '宋玥', '许宏伟', '李丹阳', '陈宝洁',
                    '冯培玉', '李兆宣', '张宇生', '郭美歧', '张胜瑀', '赵紫怡', '胡梦玲', '姜岩', '商博', '杨岳', '朱海波', '王家仪', '赵云静', '张嘉宸', '王婕',
                    '朱芮莹', '姚欣宇', '邢一凡', '于航', '姜寓琪', '迟佳怡', '任怡娇', '王震', '卢宇佳', '崔艺曦', '许家宁', '于清冰', '孙嘉悦', '司东杰',
                    '吴凯', '董硕', '祁向冉', '陈艺', '罗志泽', '陈晓波', '张靖婕']

CLASS_4_GROUPS_SELECTOR = [f"第{str(i)}组" for i in range(1, 9)]

CLASS_4_STUDENTS = ['于学跃', '高媛媛', '闫圣奇', '于阳阳', '罗弘奇', '郑浩天', '赵英杰', '李新伟', '李娜', '范宏鑫', '宋雨欣', '张忠杨', '张凯淇', '杨舒涵',
                    '杨晓渊', '郭明泽', '吴伟华', '李欣宇', '徐绍伦', '明将卫', '张思淼', '陈勇杰', '卢庆旺', '刘凯鹏', '王诗涵', '黄静雯', '任庆辉', '刘书君',
                    '张佳慧', '孟令浩', '汪俊浩', '孟娜', '张嘉欣', '李振宁', '杨建华', '张丽敏', '魏孜胜', '孙煜凯', '张少迪', '韩鑫鑫', '高旗', '陈香羽',
                    '于雯琪', '张紫越', '刘萌萌', '姜雨汐', '辛禹彤', '陆弘达', '周鑫彤', '宋蕊', '张高旺', '马鸣辉', '倪欣瑶', '安炳赫', '韩博']

COLOR_SELECTOR = [
    "# 000000", "#2F0000", "#600030", "#460046", "#28004D", "# 272727", "#4D0000", "#820041", "#5E005E", "#3A006F",
    "# 3C3C3C", "#600000", "#9F0050", "#750075", "#4B0091", "# 4F4F4F", "#750000", "#BF0060", "#930093", "#5B00AE",
    "# 5B5B5B", "#930000", "#D9006C", "#AE00AE", "#6F00D2", "# 6C6C6C", "#AE0000", "#F00078", "#D200D2", "#8600FF",
    "# E0E0E0", "#FF9797", "#FFC1E0", "#FFBFFF", "#DCB5FF", "# F0F0F0", "#FFB5B5", "#FFD9EC", "#FFD0FF", "#E6CAFF",
    "# FCFCFC", "#FFD2D2", "# FFFFFF", "#FFECEC", "#FAF4FF", "# 000079", "#000079", "#003E3E", "#006030", "#006000",
    "# 000093", "#003D79", "#005757", "#01814A", "#007500", "# 0000C6", "#004B97", "#007979", "#019858", "#009100",
    "# 0000C6", "#005AB5", "#009393", "#01B468", "#00A600", "# 0000E3", "#0066CC", "#00AEAE", "#02C874", "#00BB00",
    "# CECEFF", "#ACD6FF", "#C1FFE4", "#BBFFBB", "# DDDDFF", "#C4E1FF", "#CEFFCE", "# ECECFF", "#D2E9FF", "# FBFBFF",
    "# 467500", "#424200", "#5B4B00", "#844200", "#642100", "# 548C00", "#5B5B00", "#796400", "#9F5000", "#842B00",
    "# 64A600", "#737300", "#977C00", "#BB5E00", "#A23400", "# 73BF00", "#8C8C00", "#AE8F00", "#D26900", "#BB3D00",
    "# 82D900", "#A6A600", "#C6A300", "#EA7500", "#D94600", "# 8CEA00", "#C4C400", "#D9B300", "#FF8000", "#F75000",
    "# DEFFAC", "#FFF0AC", "#FFCBB3", "# E8FFC4", "#FFDAC8", "# EFFFD7", "# F5FFE8", "# 613030", "#616130", "#336666",
    "#484891", "#6C3365", "# 743A3A", "#707038", "#3D7878", "#5151A2", "#7E3D76", "# 804040", "#808040", "#408080",
    "#5A5AAD", "#8F4586", "# 984B4B", "#949449", "#4F9D9D", "#7373B9", "#9F4D95",
]

